prof_repo/ProfilPortant/TD2_NACA_Profil/simpleFoam/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform $turbulentKE;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform $turbulentKE;
        value       uniform $turbulentKE;
    }

    wing
    {
        type        kqRWallFunction;
        value       uniform $turbulentKE;
    }

    #include "include/frontBackTopBottomPatches"
}

// ************************************************************************* //
